In [1]:
import numpy as np
import pandas as pd

- Series
- DataFrame

In [2]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
s1.values

array([10, 20, 30, 40], dtype=int64)

In [5]:
s2 = pd.Series([100,200,300,400],index=['a','b','c','d'])
s2

a    100
b    200
c    300
d    400
dtype: int64

In [6]:
s2['c']

300

In [7]:
s2[2]

300

In [9]:
s2[[2,3]]

c    300
d    400
dtype: int64

In [11]:
#1,3,5,7,9 ==> s1 시리즈 객체
#1,2,7,8,10 ==> s2 시리즈 객체
s1 = pd.Series([1,3,5,7,9])
s1

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [12]:
s2 = pd.Series([1,2,7,8,10])
s2

0     1
1     2
2     7
3     8
4    10
dtype: int64

In [13]:
s1+s2

0     2
1     5
2    12
3    15
4    19
dtype: int64

In [14]:
s1.index = ['a','b','c','d','e']
s1

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [15]:
s2.index =['a','c','f','g','m']
s2

a     1
c     2
f     7
g     8
m    10
dtype: int64

In [16]:
s1 + s2

a    2.0
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
m    NaN
dtype: float64

In [21]:
# 딕셔너리 
# 과일 원산지: 사과 , 배 ,망고, 두리안 
f = {'사과':'대구','배':'나주','망고':'필리핀','두리안':'말레이시아'}
f

{'두리안': '말레이시아', '망고': '필리핀', '배': '나주', '사과': '대구'}

In [22]:
fSeries = pd.Series(f)
fSeries

두리안    말레이시아
망고       필리핀
배         나주
사과        대구
dtype: object

In [23]:
#2차원 표 ==>DataFrame 
s1

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [24]:
s2

a     1
c     2
f     7
g     8
m    10
dtype: int64

In [26]:
df = pd.DataFrame([[1,2,3],[4,5,6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df[0]

0    1
1    4
Name: 0, dtype: int64

In [29]:
type(df[0])

pandas.core.series.Series

### DataFrame ==> Series + Series + Series

In [101]:
data = {
    "name" : ["홍길동","이순신","뽀로로","짱구","짱아","둘리"],
    "addrs":["율도국",'조선','뽀롱뽀롱섬','떡잎마을','떡잎마을','쌍문동'],
    'age':[550,470,7,5,1,100000000000]
}
data

{'addrs': ['율도국', '조선', '뽀롱뽀롱섬', '떡잎마을', '떡잎마을', '쌍문동'],
 'age': [550, 470, 7, 5, 1, 100000000000],
 'name': ['홍길동', '이순신', '뽀로로', '짱구', '짱아', '둘리']}

In [33]:
df2 =pd.DataFrame(data)
df2

   addrs           age name
0    율도국           550  홍길동
1     조선           470  이순신
2  뽀롱뽀롱섬             7  뽀로로
3   떡잎마을             5   짱구
4   떡잎마을             1   짱아
5    쌍문동  100000000000   둘리

In [35]:
df2.name

0    홍길동
1    이순신
2    뽀로로
3     짱구
4     짱아
5     둘리
Name: name, dtype: object

In [38]:
df2['name']

0    홍길동
1    이순신
2    뽀로로
3     짱구
4     짱아
5     둘리
Name: name, dtype: object

#### df3 에 name age addrs 순으로 데이터 프레임 만들기

df4에 name age adddrs 순 색인을 a,b,c,d,e,f 데이터 프레임 만들기

In [41]:
df3 = pd.DataFrame(data, columns=['name','age','addrs'])
df3

  name           age  addrs
0  홍길동           550    율도국
1  이순신           470     조선
2  뽀로로             7  뽀롱뽀롱섬
3   짱구             5   떡잎마을
4   짱아             1   떡잎마을
5   둘리  100000000000    쌍문동

In [43]:
df4 = pd.DataFrame (data= data,columns=['name','age','addrs'],index=['a','b','c','d','e','f'])
df4

  name           age  addrs
a  홍길동           550    율도국
b  이순신           470     조선
c  뽀로로             7  뽀롱뽀롱섬
d   짱구             5   떡잎마을
e   짱아             1   떡잎마을
f   둘리  100000000000    쌍문동

In [44]:
df4['tel'] = '010-1111-2222'
df4

  name           age  addrs            tel
a  홍길동           550    율도국  010-1111-2222
b  이순신           470     조선  010-1111-2222
c  뽀로로             7  뽀롱뽀롱섬  010-1111-2222
d   짱구             5   떡잎마을  010-1111-2222
e   짱아             1   떡잎마을  010-1111-2222
f   둘리  100000000000    쌍문동  010-1111-2222

In [45]:
s1 = pd.Series(['010-1111-2222','010-1234-5678','010-2222-3333'],index=['b','d','f'])
s1

b    010-1111-2222
d    010-1234-5678
f    010-2222-3333
dtype: object

In [46]:
df4['tel'] = s1
df4

  name           age  addrs            tel
a  홍길동           550    율도국            NaN
b  이순신           470     조선  010-1111-2222
c  뽀로로             7  뽀롱뽀롱섬            NaN
d   짱구             5   떡잎마을  010-1234-5678
e   짱아             1   떡잎마을            NaN
f   둘리  100000000000    쌍문동  010-2222-3333

In [49]:
#전치행렬 
df4.T

         a              b      c              d     e              f
name   홍길동            이순신    뽀로로             짱구    짱아             둘리
age    550            470      7              5     1   100000000000
addrs  율도국             조선  뽀롱뽀롱섬           떡잎마을  떡잎마을            쌍문동
tel    NaN  010-1111-2222    NaN  010-1234-5678   NaN  010-2222-3333

In [51]:
df4.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [52]:
df4.values

array([['홍길동', 550, '율도국', nan],
       ['이순신', 470, '조선', '010-1111-2222'],
       ['뽀로로', 7, '뽀롱뽀롱섬', nan],
       ['짱구', 5, '떡잎마을', '010-1234-5678'],
       ['짱아', 1, '떡잎마을', nan],
       ['둘리', 100000000000, '쌍문동', '010-2222-3333']], dtype=object)

In [53]:
df4.columns

Index(['name', 'age', 'addrs', 'tel'], dtype='object')

In [54]:
df4.dtypes

name     object
age       int64
addrs    object
tel      object
dtype: object

In [55]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 4 columns):
name     6 non-null object
age      6 non-null int64
addrs    6 non-null object
tel      3 non-null object
dtypes: int64(1), object(3)
memory usage: 400.0+ bytes

### 중첩리스트를 사용해서 pandas의 DataFrame 객체

In [56]:
data = [
    ['한국','서울',9699232],
    ['일본','도쿄',14000000],
    ['중국','베이징',21150000]
]
data

[['한국', '서울', 9699232], ['일본', '도쿄', 14000000], ['중국', '베이징', 21150000]]

In [57]:
pop = pd.DataFrame(data)
pop

    0    1         2
0  한국   서울   9699232
1  일본   도쿄  14000000
2  중국  베이징  21150000

In [59]:
pop.columns =['country','capital','population']
pop

  country capital  population
0      한국      서울     9699232
1      일본      도쿄    14000000
2      중국     베이징    21150000

In [63]:
# 4개 속성?
pop.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
country       3 non-null object
capital       3 non-null object
population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [64]:
pop.index = ['A','B','C']
pop

  country capital  population
A      한국      서울     9699232
B      일본      도쿄    14000000
C      중국     베이징    21150000

In [66]:
# A ,B ,C 라는 값은 의미가 별로  x 
# country 를 색인으로 사용 
pop2 = pop.set_index('country')
pop2

        capital  population
country
한국           서울     9699232
일본           도쿄    14000000
중국          베이징    21150000

In [67]:
pop3 = pop.set_index(['country','capital'])
pop3

                 population
country capital
한국      서울          9699232
일본      도쿄         14000000
중국      베이징        21150000

In [68]:
pop

  country capital  population
A      한국      서울     9699232
B      일본      도쿄    14000000
C      중국     베이징    21150000

In [69]:
#서울의 인구 출력 
pop['population']['A']

9699232

In [71]:
pop['population']['A'] + pop['population']['C']

30849232

In [73]:
pop['population'][0] + pop['population'][2]

30849232

In [99]:
#남방정책 : 베트남 , 인도네시아 .인도 인구수 ,수도 ,국가명  
# south_pop : df 
df = [
    ['베트남','하노이',805],
    ['인도네시아','자카르타',960],
    ['인도','뉴델리',2175]
]
south_pop = pd.DataFrame(df)
south_pop
#베트남과 인도의 인구수 비율 
south_pop.columns =['country','capital','population']

In [103]:
df = pd.DataFrame(data , columns =['name','age','addrs'])
df

  name           age  addrs
0  홍길동           550    율도국
1  이순신           470     조선
2  뽀로로             7  뽀롱뽀롱섬
3   짱구             5   떡잎마을
4   짱아             1   떡잎마을
5   둘리  100000000000    쌍문동

In [107]:
df['job'] = pd.Series(['도적','장군','어린이','못말려','더못말려','공룡'])
df

  name           age  addrs   job
0  홍길동           550    율도국    도적
1  이순신           470     조선    장군
2  뽀로로             7  뽀롱뽀롱섬   어린이
3   짱구             5   떡잎마을   못말려
4   짱아             1   떡잎마을  더못말려
5   둘리  100000000000    쌍문동    공룡

In [121]:
df.values
df.values[0:2]

array([['홍길동', 550, '율도국', '도적'],
       ['이순신', 470, '조선', '장군']], dtype=object)

In [123]:
df2 = df.drop(1)
df2

  name           age  addrs   job
0  홍길동           550    율도국    도적
2  뽀로로             7  뽀롱뽀롱섬   어린이
3   짱구             5   떡잎마을   못말려
4   짱아             1   떡잎마을  더못말려
5   둘리  100000000000    쌍문동    공룡

In [125]:
df3 = df.drop(columns='age',axis=1)
df3

  name  addrs   job
0  홍길동    율도국    도적
1  이순신     조선    장군
2  뽀로로  뽀롱뽀롱섬   어린이
3   짱구   떡잎마을   못말려
4   짱아   떡잎마을  더못말려
5   둘리    쌍문동    공룡

In [127]:
df3.sort_values('name') #이름 기준 정렬

  name  addrs   job
5   둘리    쌍문동    공룡
2  뽀로로  뽀롱뽀롱섬   어린이
1  이순신     조선    장군
3   짱구   떡잎마을   못말려
4   짱아   떡잎마을  더못말려
0  홍길동    율도국    도적

In [129]:
df3.sort_index(ascending=False,axis=0) #index를 기준으로 정렬

  name  addrs   job
5   둘리    쌍문동    공룡
4   짱아   떡잎마을  더못말려
3   짱구   떡잎마을   못말려
2  뽀로로  뽀롱뽀롱섬   어린이
1  이순신     조선    장군
0  홍길동    율도국    도적

In [132]:
df3.sort_values('addrs',ascending=True)

  name  addrs   job
3   짱구   떡잎마을   못말려
4   짱아   떡잎마을  더못말려
2  뽀로로  뽀롱뽀롱섬   어린이
5   둘리    쌍문동    공룡
0  홍길동    율도국    도적
1  이순신     조선    장군

In [134]:
df3.sort_index(ascending =True ,axis=0)

  name  addrs   job
0  홍길동    율도국    도적
1  이순신     조선    장군
2  뽀로로  뽀롱뽀롱섬   어린이
3   짱구   떡잎마을   못말려
4   짱아   떡잎마을  더못말려
5   둘리    쌍문동    공룡

In [136]:
df3.rank(axis=0) #오름차순으로 정렬한 후에 순위를 부여

   name  addrs  job
0   6.0    5.0  3.0
1   3.0    6.0  6.0
2   2.0    3.0  5.0
3   4.0    1.5  4.0
4   5.0    1.5  2.0
5   1.0    4.0  1.0

In [138]:
df3['addrs'].value_counts() #빈도수 출력

떡잎마을     2
조선       1
뽀롱뽀롱섬    1
율도국      1
쌍문동      1
Name: addrs, dtype: int64

In [151]:
data2= {
    'addrs' : ['대한민국 서울','일본 도쿄','미국 뉴욕'],
    'cnt' : [100,24,120]
}
df = pd.DataFrame(data2)
df
for i in df.addrs:
    print(i.split()[0])
    
[x.split()[0] for x in df.addrs]

대한민국
일본
미국

['대한민국', '일본', '미국']

s3 = pd.Series([x.split()[0] for x in df.addrs])
s3

In [153]:
s3.value_counts()

미국      1
대한민국    1
일본      1
dtype: int64

In [155]:
result2 = pd.Series([x.split()[1] for x in df.addrs])
result2

0    서울
1    도쿄
2    뉴욕
dtype: object

In [157]:
data = pd.Series([2.5,1.6,2.7,-3.3],index=('d','b','a','c'))
data

d    2.5
b    1.6
a    2.7
c   -3.3
dtype: float64

In [160]:
#인덱스를 다시 지정하기 
data2 = data.reindex(['a','b','c','d'])
data2

a    2.7
b    1.6
c   -3.3
d    2.5
dtype: float64

In [162]:
data3 = pd.Series(['마우스','키보드','모니터'], index=[0,2,3])
data3

0    마우스
2    키보드
3    모니터
dtype: object

In [164]:
data3.reindex(range(6), method ='ffill') #앞의 값으로 누락값을 채워 넣기

0    마우스
1    마우스
2    키보드
3    모니터
4    모니터
5    모니터
dtype: object

In [166]:
data3.reindex(range(6), method ='bfill') #뒤의 값으로 누락값을 채워 넣기

0    마우스
1    키보드
2    키보드
3    모니터
4    NaN
5    NaN
dtype: object

In [181]:
df = pd.DataFrame(np.arange(1,7).reshape(3,2),index=['1월','3월','4월'],
                  columns=['강남','강북'])
df

    강남  강북
1월   1   2
3월   3   4
4월   5   6

In [185]:
# 1월 2월 3월 4월 
df2 = df.reindex(['1월','2월','3월','4월'])
df3 = df.reindex(['1월','2월','3월','4월'],method ='ffill')
df3

    강남  강북
1월   1   2
2월   1   2
3월   3   4
4월   5   6

In [188]:
site = ['강남','종로','홍대']
df.reindex(columns=site)

    강남  종로  홍대
1월   1 NaN NaN
3월   3 NaN NaN
4월   5 NaN NaN

In [191]:
df.reindex(['1월','2월','3월','4월'],columns=site)

     강남  종로  홍대
1월  1.0 NaN NaN
2월  NaN NaN NaN
3월  3.0 NaN NaN
4월  5.0 NaN NaN

In [193]:
df.reindex(['1월','2월','3월','4월'],columns=site,method = 'ffill')

    강남  종로  홍대
1월   1   2   2
2월   1   2   2
3월   3   4   4
4월   5   6   6

In [209]:
#         한국 일본 미국
# 1월     0     1    2
# 2월     3     4    5
# 3월     6     7    8
# 4월     9    10   11

#0부터 11까지 배열 
#모양 4행3열로 변화
#df 객체로 만들때 index , columns 

temp = np.arange(12).reshape(4,3)
temp
df = pd.DataFrame(np.arange(12).reshape(4,3),index=['1월','2월','3월','4월'],columns=['한국','일본','미국'])
df

    한국  일본  미국
1월   0   1   2
2월   3   4   5
3월   6   7   8
4월   9  10  11

In [210]:
df['한국']

1월    0
2월    3
3월    6
4월    9
Name: 한국, dtype: int32

In [211]:
df['한국'] >3

1월    False
2월    False
3월     True
4월     True
Name: 한국, dtype: bool

In [212]:
df['한국'][df['한국']>=3]

2월    3
3월    6
4월    9
Name: 한국, dtype: int32

In [214]:
#미국의 8이상인 데이터만 출력 
df['미국'][df['미국']>=8]

3월     8
4월    11
Name: 미국, dtype: int32

In [226]:
#주의 사항 
df2 = pd.DataFrame(np.arange(9).reshape(3,3),index=['1','2','3'])
df2
df2[1][2]

7

In [230]:
df[['한국','일본']]

    한국  일본
1월   0   1
2월   3   4
3월   6   7
4월   9  10

In [232]:
df[['한국','일본']]

    한국  일본
1월   0   1
2월   3   4
3월   6   7
4월   9  10

In [234]:
df.loc['3월',['한국','일본']]

한국    6
일본    7
Name: 3월, dtype: int32

In [236]:
type(df.loc['3월',['한국','일본']])

pandas.core.series.Series

In [243]:
# 2월 한국 미국

In [246]:
df.loc[['1월','2월'],['한국','미국']]

    한국  미국
1월   0   2
2월   3   5

In [253]:
df.iloc[:2] # integer position  2행전부

    한국  일본  미국
1월   0   1   2
2월   3   4   5

In [255]:
df.loc[:'2월']

    한국  일본  미국
1월   0   1   2
2월   3   4   5

In [260]:
iris = pd.read_csv('iris.csv')
iris
df = pd.DataFrame(iris)
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
9             4.9          3.1           1.5          0.1     setosa
10            5.4          3.7           1.5          0.2     setosa
11            4.8          3.4           1.6          0.2     setosa
12            4.8          3.0           1.4          0.1     setosa
13            4.3          3.0           1.1          0.1     setosa
14            5.8          4.0           1.2          0.2     setosa
15            5.7          4.4           1.5          0.4     setosa
16            5.4          3.9           1.3          0.4     setosa
17            5.1          3.5           1.4          0.3     setosa
18            5.7          3.8           1.7          0.3     setosa
19            5.1          3.8           1.5          0.3     setosa
20            5.4          3.4           1.7          0.2     setosa
21            5.1          3.7           1.5          0.4     setosa
22            4.6          3.6           1.0          0.2     setosa
23            5.1          3.3           1.7          0.5     setosa
24            4.8          3.4           1.9          0.2     setosa
25            5.0          3.0           1.6          0.2     setosa
26            5.0          3.4           1.6          0.4     setosa
27            5.2          3.5           1.5          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
..            ...          ...           ...          ...        ...
120           6.9          3.2           5.7          2.3  virginica
121           5.6          2.8           4.9          2.0  virginica
122           7.7          2.8           6.7          2.0  virginica
123           6.3          2.7           4.9          1.8  virginica
124           6.7          3.3           5.7          2.1  virginica
125           7.2          3.2           6.0          1.8  virginica
126           6.2          2.8           4.8          1.8  virginica
127           6.1          3.0           4.9          1.8  virginica
128           6.4          2.8           5.6          2.1  virginica
129           7.2          3.0           5.8          1.6  virginica
130           7.4          2.8           6.1          1.9  virginica
131           7.9          3.8           6.4          2.0  virginica
132           6.4          2.8           5.6          2.2  virginica
133           6.3          2.8           5.1          1.5  virginica
134           6.1          2.6           5.6          1.4  virginica
135           7.7          3.0           6.1          2.3  virginica
136           6.3          3.4           5.6          2.4  virginica
137           6.4          3.1           5.5          1.8  virginica
138           6.0          3.0           4.8          1.8  virginica
139           6.9          3.1           5.4          2.1  virginica
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [266]:
#setosa 
df[df['Species']=="setosa"]

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.2  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.6           1.4          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
41           4.5          2.3           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

In [269]:
df = pd.DataFrame(np.arange(12).reshape(4,3),index=['1월','2월','3월','4월'],columns=['한국','일본','미국'])
df

    한국  일본  미국
1월   0   1   2
2월   3   4   5
3월   6   7   8
4월   9  10  11

In [271]:
df.to_json()

'{"\\ud55c\\uad6d":{"1\\uc6d4":0,"2\\uc6d4":3,"3\\uc6d4":6,"4\\uc6d4":9},"\\uc77c\\ubcf8":{"1\\uc6d4":1,"2\\uc6d4":4,"3\\uc6d4":7,"4\\uc6d4":10},"\\ubbf8\\uad6d":{"1\\uc6d4":2,"2\\uc6d4":5,"3\\uc6d4":8,"4\\uc6d4":11}}'

In [273]:
df9 = df.to_json()
df9

'{"\\ud55c\\uad6d":{"1\\uc6d4":0,"2\\uc6d4":3,"3\\uc6d4":6,"4\\uc6d4":9},"\\uc77c\\ubcf8":{"1\\uc6d4":1,"2\\uc6d4":4,"3\\uc6d4":7,"4\\uc6d4":10},"\\ubbf8\\uad6d":{"1\\uc6d4":2,"2\\uc6d4":5,"3\\uc6d4":8,"4\\uc6d4":11}}'

In [276]:
newdf = pd.read_json(df9)
newdf

    미국  일본  한국
1월   2   1   0
2월   5   4   3
3월   8   7   6
4월  11  10   9

In [277]:
#csv (comma seperate value), tsv (tab seperate value)

In [279]:
iris

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
9             4.9          3.1           1.5          0.1     setosa
10            5.4          3.7           1.5          0.2     setosa
11            4.8          3.4           1.6          0.2     setosa
12            4.8          3.0           1.4          0.1     setosa
13            4.3          3.0           1.1          0.1     setosa
14            5.8          4.0           1.2          0.2     setosa
15            5.7          4.4           1.5          0.4     setosa
16            5.4          3.9           1.3          0.4     setosa
17            5.1          3.5           1.4          0.3     setosa
18            5.7          3.8           1.7          0.3     setosa
19            5.1          3.8           1.5          0.3     setosa
20            5.4          3.4           1.7          0.2     setosa
21            5.1          3.7           1.5          0.4     setosa
22            4.6          3.6           1.0          0.2     setosa
23            5.1          3.3           1.7          0.5     setosa
24            4.8          3.4           1.9          0.2     setosa
25            5.0          3.0           1.6          0.2     setosa
26            5.0          3.4           1.6          0.4     setosa
27            5.2          3.5           1.5          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
..            ...          ...           ...          ...        ...
120           6.9          3.2           5.7          2.3  virginica
121           5.6          2.8           4.9          2.0  virginica
122           7.7          2.8           6.7          2.0  virginica
123           6.3          2.7           4.9          1.8  virginica
124           6.7          3.3           5.7          2.1  virginica
125           7.2          3.2           6.0          1.8  virginica
126           6.2          2.8           4.8          1.8  virginica
127           6.1          3.0           4.9          1.8  virginica
128           6.4          2.8           5.6          2.1  virginica
129           7.2          3.0           5.8          1.6  virginica
130           7.4          2.8           6.1          1.9  virginica
131           7.9          3.8           6.4          2.0  virginica
132           6.4          2.8           5.6          2.2  virginica
133           6.3          2.8           5.1          1.5  virginica
134           6.1          2.6           5.6          1.4  virginica
135           7.7          3.0           6.1          2.3  virginica
136           6.3          3.4           5.6          2.4  virginica
137           6.4          3.1           5.5          1.8  virginica
138           6.0          3.0           4.8          1.8  virginica
139           6.9          3.1           5.4          2.1  virginica
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [283]:
iris.to_csv('iris2.csv')

    #### 인덱스는 제외하고 싶다면

In [285]:
iris.to_csv('iris2.csv',index=False)

In [ ]:
iris.to_excle('iris2.')